package ExercisesFromLetPy;

//Напишите программу, которая выводит на экран все четные числа начиная с 2 и заканчивая 20. Каждое из чисел должно быть
// выведено на новой строке. Для создания цикла используйте оператор while.

public class Ex24_84 {
    public static void main(String[] args) {
        int i = 2;
        while (i <= 20) {
            System.out.println(i);
            i += 2;
        }
    }


}
