package ExercisesFromJavaRush.level7.level8;

/*
Минимальное целое
Создай по одной переменной каждого примитивного целочисленного типа в классе Solution.
Этим переменным присвой минимально возможное для них значение.
Никаких методов создавать не нужно.

Требования:
•	В классе Solution должны быть созданы переменные всех примитивных целочисленного типов.
•	Всем целочисленным переменным должно быть присвоено минимально возможное для них значение.
•	В классе Solution не должно быть создано никаких методов.
*/

public class JRProTask0703 {
    byte a = Byte.MIN_VALUE;
    short b = Short.MIN_VALUE;
    int c = Integer.MIN_VALUE;
    long d = Long.MIN_VALUE;
}







