package ExercisesFromJavaRush.level7.level8;

/*
Максимальное целое
Создай по одной переменной каждого примитивного целочисленного типа в классе Solution.
Этим переменным присвой максимально возможное для них значение.
Никаких методов создавать не нужно.

Требования:
•	В классе Solution должны быть созданы переменные всех примитивных целочисленных типов.
•	Всем целочисленным переменным должно быть присвоено максимально возможное для них значение.
•	В классе Solution не должно быть создано никаких методов.
*/

public class JRProTask0702 {
    byte a = Byte.MAX_VALUE;
    short b = Short.MAX_VALUE;
    int c = Integer.MAX_VALUE;
    long d = Long.MAX_VALUE;
}







